if OS.mac?
  tap "laishulu/homebrew"

  brew "defaultbrowser"
  brew "laishulu/homebrew/macism"  # IME切り替え（Neovim用）
  brew "trash"       # rm の代わりに使用（復元可能、macOS専用）

  cask "1password"
  cask "alt-tab"
  cask "aqua-voice"
  cask "arc"
  cask "chatwork"
  cask "cleanshot"
  cask "discord"
  cask "displaylink"
  cask "font-hackgen"
  cask "ghostty"
  cask "google-chrome"
  cask "homerow"
  cask "logi-options+"
  cask "nani"
  cask "notion"
  cask "obsidian"
  cask "positron"
  cask "raindropio"
  cask "raycast"
  cask "slack"
end

brew "fzf"
brew "gh"
brew "mise"
brew "neovim"
brew "starship"
brew "tree"
brew "zellij"
brew "zsh-autosuggestions"
